In [1]:
import pandas as pd
import numpy as np

# 1. Create Dataframe

In [2]:
df1 = pd.DataFrame([11, 22, 33])
print(df1)

    0
0  11
1  22
2  33

In [3]:
df1 = pd.DataFrame([11, 22, 33], columns = ['col_name'])
print(df1)

   col_name
0        11
1        22
2        33

In [4]:
print(type(df1))

<class 'pandas.core.frame.DataFrame'>

In [5]:
# 5 rows, 3 columns of random numbers (0â€“1)
data = np.random.rand(5, 3)

df = pd.DataFrame(data, columns=['A', 'B', 'C'])
print(df)

          A         B         C
0  0.164456  0.235748  0.872693
1  0.960096  0.197582  0.986232
2  0.478154  0.275527  0.533600
3  0.809629  0.643015  0.357908
4  0.114939  0.426365  0.090550

In [6]:
data = {
    'Name':['Tom', 'Roy', 'john', 'Cory'],
    'Age': [22, 24, 25, 21],
    'Salary': [90000, 70000, 50000, 30000]
}

In [7]:
df = pd.DataFrame(data)
df

   Name  Age  Salary
0   Tom   22   90000
1   Roy   24   70000
2  john   25   50000
3  Cory   21   30000

In [8]:
type(df)

pandas.core.frame.DataFrame

# 2. Basic Dataframe Understanding

In [9]:
df.head()   # getting top 5 rows

   Name  Age  Salary
0   Tom   22   90000
1   Roy   24   70000
2  john   25   50000
3  Cory   21   30000

In [10]:
df.tail()   # show last 5 rows

   Name  Age  Salary
0   Tom   22   90000
1   Roy   24   70000
2  john   25   50000
3  Cory   21   30000

In [11]:
df.shape

(4, 3)

In [12]:
df.columns

Index(['Name', 'Age', 'Salary'], dtype='object')

In [13]:
# Renaming the columns
df.rename(columns = {'Salary': 'Monthly_Salary'}, inplace = True)

In [14]:
df.head()

   Name  Age  Monthly_Salary
0   Tom   22           90000
1   Roy   24           70000
2  john   25           50000
3  Cory   21           30000

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Name            4 non-null      object
 1   Age             4 non-null      int64
 2   Monthly_Salary  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 228.0+ bytes

In [16]:
df.describe()

             Age  Monthly_Salary
count   4.000000        4.000000
mean   23.000000    60000.000000
std     1.825742    25819.888975
min    21.000000    30000.000000
25%    21.750000    45000.000000
50%    23.000000    60000.000000
75%    24.250000    75000.000000
max    25.000000    90000.000000

# 3. Save and Load data from csv

In [17]:
# Saving the csv file
df.to_csv('Test_data.csv', index =False)

In [18]:
# Loading the dataframe
df_load = pd.read_csv('Test_data.csv')
df_load

   Name  Age  Monthly_Salary
0   Tom   22           90000
1   Roy   24           70000
2  john   25           50000
3  Cory   21           30000

# 4. Rows & Columns - Selection

In [19]:
df.columns = df.columns.str.lower()

In [20]:
df.head()

   name  age  monthly_salary
0   Tom   22           90000
1   Roy   24           70000
2  john   25           50000
3  Cory   21           30000

In [21]:
# Select column
df[['name', 'age']]

   name  age
0   Tom   22
1   Roy   24
2  john   25
3  Cory   21

In [22]:
# select rows
df.loc[df.name =='Roy']

  name  age  monthly_salary
1  Roy   24           70000

In [23]:
df.loc[(df.name =='Roy')  & (df.monthly_salary >=50000)]

  name  age  monthly_salary
1  Roy   24           70000

In [24]:
df.loc[0:2]

   name  age  monthly_salary
0   Tom   22           90000
1   Roy   24           70000
2  john   25           50000

In [25]:
# iloc -  index- value based
df.iloc[0]

name                Tom
age                  22
monthly_salary    90000
Name: 0, dtype: object

In [26]:
df.iloc[0:2]   # [start:stop:step]

  name  age  monthly_salary
0  Tom   22           90000
1  Roy   24           70000

# 5. Filter Dataframe

In [27]:
df

   name  age  monthly_salary
0   Tom   22           90000
1   Roy   24           70000
2  john   25           50000
3  Cory   21           30000

In [28]:
df[df['age'] >22]

   name  age  monthly_salary
1   Roy   24           70000
2  john   25           50000

In [29]:
df[(df['age']>22) & (df['monthly_salary']>50000)]

  name  age  monthly_salary
1  Roy   24           70000

In [30]:
df.where(df['age']>22)

   name   age  monthly_salary
0   NaN   NaN             NaN
1   Roy  24.0         70000.0
2  john  25.0         50000.0
3   NaN   NaN             NaN

In [31]:
df.where(df['age']>22, other = 'Not Eligible')

           name           age monthly_salary
0  Not Eligible  Not Eligible   Not Eligible
1           Roy            24          70000
2          john            25          50000
3  Not Eligible  Not Eligible   Not Eligible

# 6. Rows and Columns  - Operations (Add, Update, Delete)

In [32]:
df

   name  age  monthly_salary
0   Tom   22           90000
1   Roy   24           70000
2  john   25           50000
3  Cory   21           30000

In [33]:
# add new column
df['team'] = ['CEO', 'HR', 'CTO', 'DA']
df

   name  age  monthly_salary team
0   Tom   22           90000  CEO
1   Roy   24           70000   HR
2  john   25           50000  CTO
3  Cory   21           30000   DA

In [34]:
df['bonus'] = df['monthly_salary']  * 0.2
df

   name  age  monthly_salary team    bonus
0   Tom   22           90000  CEO  18000.0
1   Roy   24           70000   HR  14000.0
2  john   25           50000  CTO  10000.0
3  Cory   21           30000   DA   6000.0

In [35]:
# add new ROW
df.loc[len(df)] = ['ABC', 21, 21000, 'IT', 2000]
df

   name  age  monthly_salary team    bonus
0   Tom   22           90000  CEO  18000.0
1   Roy   24           70000   HR  14000.0
2  john   25           50000  CTO  10000.0
3  Cory   21           30000   DA   6000.0
4   ABC   21           21000   IT   2000.0

In [36]:
len(df)

5

In [37]:
# update value - [using index name]
df.loc[0, 'monthly_salary'] = 95000
df

   name  age  monthly_salary team    bonus
0   Tom   22           95000  CEO  18000.0
1   Roy   24           70000   HR  14000.0
2  john   25           50000  CTO  10000.0
3  Cory   21           30000   DA   6000.0
4   ABC   21           21000   IT   2000.0

In [38]:
# update value -  using column value
df.loc[df.name == 'Tom', 'monthly_salary'] = 90000

In [39]:
df

   name  age  monthly_salary team    bonus
0   Tom   22           90000  CEO  18000.0
1   Roy   24           70000   HR  14000.0
2  john   25           50000  CTO  10000.0
3  Cory   21           30000   DA   6000.0
4   ABC   21           21000   IT   2000.0

#### delete value -- row and column values

In [40]:
df = df.drop(df[df.name == 'ABC'].index)  # drop row, axis = 0
df

   name  age  monthly_salary team    bonus
0   Tom   22           90000  CEO  18000.0
1   Roy   24           70000   HR  14000.0
2  john   25           50000  CTO  10000.0
3  Cory   21           30000   DA   6000.0

In [41]:
df

   name  age  monthly_salary team    bonus
0   Tom   22           90000  CEO  18000.0
1   Roy   24           70000   HR  14000.0
2  john   25           50000  CTO  10000.0
3  Cory   21           30000   DA   6000.0

In [42]:
df.drop(1, axis=0)

   name  age  monthly_salary team    bonus
0   Tom   22           90000  CEO  18000.0
2  john   25           50000  CTO  10000.0
3  Cory   21           30000   DA   6000.0

In [43]:
df.drop('bonus', axis = 1)

   name  age  monthly_salary team
0   Tom   22           90000  CEO
1   Roy   24           70000   HR
2  john   25           50000  CTO
3  Cory   21           30000   DA

In [44]:
df.drop(['bonus', 'team'], axis =1)    # deleting multiple columns

   name  age  monthly_salary
0   Tom   22           90000
1   Roy   24           70000
2  john   25           50000
3  Cory   21           30000

In [45]:
df

   name  age  monthly_salary team    bonus
0   Tom   22           90000  CEO  18000.0
1   Roy   24           70000   HR  14000.0
2  john   25           50000  CTO  10000.0
3  Cory   21           30000   DA   6000.0

In [46]:
df.rename(columns = {'monthly_salary' : 'salary'}, inplace=True)

In [47]:
# sort value
df.sort_values('salary')    # by default ascending order

   name  age  salary team    bonus
3  Cory   21   30000   DA   6000.0
2  john   25   50000  CTO  10000.0
1   Roy   24   70000   HR  14000.0
0   Tom   22   90000  CEO  18000.0

In [48]:
df.sort_values('salary', ascending = False)    # by default ascending order

   name  age  salary team    bonus
0   Tom   22   90000  CEO  18000.0
1   Roy   24   70000   HR  14000.0
2  john   25   50000  CTO  10000.0
3  Cory   21   30000   DA   6000.0

# 7. Working with date values

In [49]:
df['DOJ'] = ['2024-01-01', '2024-01-15', '2024-03-28', '2023-03-03']
df

   name  age  salary team    bonus         DOJ
0   Tom   22   90000  CEO  18000.0  2024-01-01
1   Roy   24   70000   HR  14000.0  2024-01-15
2  john   25   50000  CTO  10000.0  2024-03-28
3  Cory   21   30000   DA   6000.0  2023-03-03

In [50]:
df['DOJ'].dtype

dtype('O')

In [51]:
df['DOJ'] = pd.to_datetime(df['DOJ'])

In [52]:
df['DOJ'].dtype

dtype('<M8[ns]')

In [53]:
df1 = df

In [54]:
df1['DOJ2'] = ['01-01-2024', '15-01-2025', '28-03-2025', '03-03-2025']

In [55]:
df1

   name  age  salary team    bonus        DOJ        DOJ2
0   Tom   22   90000  CEO  18000.0 2024-01-01  01-01-2024
1   Roy   24   70000   HR  14000.0 2024-01-15  15-01-2025
2  john   25   50000  CTO  10000.0 2024-03-28  28-03-2025
3  Cory   21   30000   DA   6000.0 2023-03-03  03-03-2025

In [56]:
df1['DOJ2'].dtype

dtype('O')

In [57]:
df1['DOJ2'] = pd.to_datetime(df1['DOJ2'], format = '%d-%m-%Y')

In [58]:
df1['DOJ2'].dtype

dtype('<M8[ns]')

In [59]:
 df

   name  age  salary team    bonus        DOJ       DOJ2
0   Tom   22   90000  CEO  18000.0 2024-01-01 2024-01-01
1   Roy   24   70000   HR  14000.0 2024-01-15 2025-01-15
2  john   25   50000  CTO  10000.0 2024-03-28 2025-03-28
3  Cory   21   30000   DA   6000.0 2023-03-03 2025-03-03

In [60]:
df = df.drop('DOJ2', axis =1)
df

   name  age  salary team    bonus        DOJ
0   Tom   22   90000  CEO  18000.0 2024-01-01
1   Roy   24   70000   HR  14000.0 2024-01-15
2  john   25   50000  CTO  10000.0 2024-03-28
3  Cory   21   30000   DA   6000.0 2023-03-03

In [61]:
df['year'] = df.DOJ.dt.year
df

   name  age  salary team    bonus        DOJ  year
0   Tom   22   90000  CEO  18000.0 2024-01-01  2024
1   Roy   24   70000   HR  14000.0 2024-01-15  2024
2  john   25   50000  CTO  10000.0 2024-03-28  2024
3  Cory   21   30000   DA   6000.0 2023-03-03  2023

In [62]:
df['month'] = df.DOJ.dt.month
df

   name  age  salary team    bonus        DOJ  year  month
0   Tom   22   90000  CEO  18000.0 2024-01-01  2024      1
1   Roy   24   70000   HR  14000.0 2024-01-15  2024      1
2  john   25   50000  CTO  10000.0 2024-03-28  2024      3
3  Cory   21   30000   DA   6000.0 2023-03-03  2023      3

In [63]:
df['day'] = df.DOJ.dt.day
df

   name  age  salary team    bonus        DOJ  year  month  day
0   Tom   22   90000  CEO  18000.0 2024-01-01  2024      1    1
1   Roy   24   70000   HR  14000.0 2024-01-15  2024      1   15
2  john   25   50000  CTO  10000.0 2024-03-28  2024      3   28
3  Cory   21   30000   DA   6000.0 2023-03-03  2023      3    3

In [64]:
df['day_name'] = df.DOJ.dt.day_name()
df

   name  age  salary team    bonus        DOJ  year  month  day  day_name
0   Tom   22   90000  CEO  18000.0 2024-01-01  2024      1    1    Monday
1   Roy   24   70000   HR  14000.0 2024-01-15  2024      1   15    Monday
2  john   25   50000  CTO  10000.0 2024-03-28  2024      3   28  Thursday
3  Cory   21   30000   DA   6000.0 2023-03-03  2023      3    3    Friday

In [65]:
df['probation_end'] = df['DOJ'] + pd.Timedelta(days=90)
df

,name,age,salary,team,bonus,DOJ,year,month,day,day_name,probation_end
0,Tom,22,90000,CEO,18000.0,2024-01-01,2024,1,1,Monday,2024-03-31
1,Roy,24,70000,HR,14000.0,2024-01-15,2024,1,15,Monday,2024-04-14
2,john,25,50000,CTO,10000.0,2024-03-28,2024,3,28,Thursday,2024-06-26
3,Cory,21,30000,DA,6000.0,2023-03-03,2023,3,3,Friday,2023-06-01

In [66]:
df.drop(['DOJ',	'year',	'day'	, 'month'	, 'day_name', 'probation_end'], inplace=True, axis=1)
df

   name  age  salary team    bonus
0   Tom   22   90000  CEO  18000.0
1   Roy   24   70000   HR  14000.0
2  john   25   50000  CTO  10000.0
3  Cory   21   30000   DA   6000.0

# 8. Handling Null values

In [67]:
df.loc[df.name == 'john', 'salary'] = np.nan
df

   name  age   salary team    bonus
0   Tom   22  90000.0  CEO  18000.0
1   Roy   24  70000.0   HR  14000.0
2  john   25      NaN  CTO  10000.0
3  Cory   21  30000.0   DA   6000.0

In [68]:
df.isna().sum()

name      0
age       0
salary    1
team      0
bonus     0
dtype: int64

In [69]:
df.fillna(0)

   name  age   salary team    bonus
0   Tom   22  90000.0  CEO  18000.0
1   Roy   24  70000.0   HR  14000.0
2  john   25      0.0  CTO  10000.0
3  Cory   21  30000.0   DA   6000.0

In [70]:
df

   name  age   salary team    bonus
0   Tom   22  90000.0  CEO  18000.0
1   Roy   24  70000.0   HR  14000.0
2  john   25      NaN  CTO  10000.0
3  Cory   21  30000.0   DA   6000.0

In [71]:
df.loc[df.name == 'john', 'salary'] = 50000
df

   name  age   salary team    bonus
0   Tom   22  90000.0  CEO  18000.0
1   Roy   24  70000.0   HR  14000.0
2  john   25  50000.0  CTO  10000.0
3  Cory   21  30000.0   DA   6000.0

In [72]:
df['DOJ'] = ['2024-01-01', '2024-01-15', '2024-03-28', '2023-03-03']
df

   name  age   salary team    bonus         DOJ
0   Tom   22  90000.0  CEO  18000.0  2024-01-01
1   Roy   24  70000.0   HR  14000.0  2024-01-15
2  john   25  50000.0  CTO  10000.0  2024-03-28
3  Cory   21  30000.0   DA   6000.0  2023-03-03

In [73]:
df['DOJ'] = pd.to_datetime(df['DOJ'])
df['month'] = df['DOJ'].dt.month

In [74]:
df['month'] = df['DOJ'].dt.month
df

   name  age   salary team    bonus        DOJ  month
0   Tom   22  90000.0  CEO  18000.0 2024-01-01      1
1   Roy   24  70000.0   HR  14000.0 2024-01-15      1
2  john   25  50000.0  CTO  10000.0 2024-03-28      3
3  Cory   21  30000.0   DA   6000.0 2023-03-03      3

# 9. Aggregation and groupby

In [75]:
df.month.value_counts

<bound method IndexOpsMixin.value_counts of 0    1
1    1
2    3
3    3
Name: month, dtype: int32>

In [76]:
df.team.value_counts()

team
CEO    1
HR     1
CTO    1
DA     1
Name: count, dtype: int64

In [77]:
df[df['month']==1].value_counts()

name  age  salary   team  bonus    DOJ         month
Roy   24   70000.0  HR    14000.0  2024-01-15  1        1
Tom   22   90000.0  CEO   18000.0  2024-01-01  1        1
Name: count, dtype: int64

In [78]:
df.groupby('month')['salary'].sum()   # aggregation based on groupby

month
1    160000.0
3     80000.0
Name: salary, dtype: float64

In [79]:
df.groupby('month').agg({'salary': 'mean', 'name':'count'})

        salary  name
month
1      80000.0     2
3      40000.0     2

# 10. Concatenate and Merge Dataframe

In [80]:
df1 = pd.DataFrame({'ID':[1,2,3], 'Name':['A', 'B', 'C']})
df1

   ID Name
0   1    A
1   2    B
2   3    C

In [81]:
df2 = pd.DataFrame({'ID':[1,2,2,4], 'Score':[88,96,77,79]})
df2

   ID  Score
0   1     88
1   2     96
2   2     77
3   4     79

In [82]:
pd.concat([df1, df2], axis =0)

   ID Name  Score
0   1    A    NaN
1   2    B    NaN
2   3    C    NaN
0   1  NaN   88.0
1   2  NaN   96.0
2   2  NaN   77.0
3   4  NaN   79.0

In [83]:
pd.concat([df1, df2], axis=1)

    ID Name  ID  Score
0  1.0    A   1     88
1  2.0    B   2     96
2  3.0    C   2     77
3  NaN  NaN   4     79

In [84]:
pd.merge(df1, df2,  how="inner", on="ID")

   ID Name  Score
0   1    A     88
1   2    B     96
2   2    B     77

In [85]:
pd.merge(df1, df2,  how="outer", on="ID")

   ID Name  Score
0   1    A   88.0
1   2    B   96.0
2   2    B   77.0
3   3    C    NaN
4   4  NaN   79.0

In [86]:
pd.merge(df1, df2,  how="left", on="ID")

   ID Name  Score
0   1    A   88.0
1   2    B   96.0
2   2    B   77.0
3   3    C    NaN

In [87]:
pd.merge(df1, df2,  how="right", on="ID")

   ID Name  Score
0   1    A     88
1   2    B     96
2   2    B     77
3   4  NaN     79

In [88]:
pd.merge(df1, df2,  how = 'inner', left_on="ID", right_on = 'ID')

   ID Name  Score
0   1    A     88
1   2    B     96
2   2    B     77

In [89]:
df[(df.month ==1) & (df.salary >=70000)]   # basic method

  name  age   salary team    bonus        DOJ  month
0  Tom   22  90000.0  CEO  18000.0 2024-01-01      1
1  Roy   24  70000.0   HR  14000.0 2024-01-15      1

In [90]:
df.query('month==1 and salary >=70000')   # query method

  name  age   salary team    bonus        DOJ  month
0  Tom   22  90000.0  CEO  18000.0 2024-01-01      1
1  Roy   24  70000.0   HR  14000.0 2024-01-15      1

### create a dataframe to practice pivot table in pandas

In [91]:
import pandas as pd

data = {
    "Region": ["East", "East", "West", "West", "North", "North", "East", "West"],
    "Product": ["A", "B", "A", "B", "A", "B", "A", "B"],
    "Salesperson": ["John", "John", "Sara", "Sara", "Mike", "Mike", "John", "Sara"],
    "Units_Sold": [10, 15, 8, 12, 20, 18, 7, 9],
    "Revenue": [100, 150, 80, 120, 200, 180, 70, 90]
}

df = pd.DataFrame(data)
df

  Region Product Salesperson  Units_Sold  Revenue
0   East       A        John          10      100
1   East       B        John          15      150
2   West       A        Sara           8       80
3   West       B        Sara          12      120
4  North       A        Mike          20      200
5  North       B        Mike          18      180
6   East       A        John           7       70
7   West       B        Sara           9       90

In [92]:
pd.pivot_table(df, values="Revenue", index="Region", aggfunc="sum")

        Revenue
Region
East        320
North       380
West        290

In [93]:
pd.pivot_table(df, values="Units_Sold", index="Product", aggfunc="mean")

         Units_Sold
Product
A             11.25
B             13.50

In [94]:
pd.pivot_table(df, values="Revenue", index="Region", columns="Product", aggfunc="sum")

Product    A    B
Region
East     170  150
North    200  180
West      80  210

In [95]:
pd.pivot_table(df, values=["Revenue", "Units_Sold"],
               index="Region", columns="Product",
               aggfunc="sum")

        Revenue      Units_Sold
Product       A    B          A   B
Region
East        170  150         17  15
North       200  180         20  18
West         80  210          8  21

In [96]:
pd.pivot_table(df, values="Revenue", index="Region", columns="Product",
               aggfunc="sum", margins=True)

Product    A    B  All
Region
East     170  150  320
North    200  180  380
West      80  210  290
All      450  540  990

In [97]:
pd.pivot_table(df, values="Revenue", index="Region", aggfunc="sum")

        Revenue
Region
East        320
North       380
West        290

In [98]:
df.groupby("Region")["Revenue"].sum()

Region
East     320
North    380
West     290
Name: Revenue, dtype: int64